# ImportLevels Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AXMImportOptions..::..ImportLevels Property
AXMImportOptions Class See Also
---
Indicate if levels are to be imported. False by default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public bool ImportLevels { get; set; }
```

Visual Basic
---
```text
Public Property ImportLevels As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ImportLevels {
	bool get ();
	void set (bool value);
}
```

# See Also
AXMImportOptions Class
Autodesk.Revit.DB Namespace